In [19]:
#Add matplotlib inline magic command

%matplotlib inline

#import dependencies 

import matplotlib.pyplot as plt

import pandas as pd

import os

# join csv and read


city_data=os.path.join("Resources","city_data.csv")
ride_data=os.path.join("Resources","ride_data.csv")


city_df=pd.read_csv(city_data)
ride_df=pd.read_csv(ride_data)


city_df

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [8]:
# use count() to find names of columns
city_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [9]:
# check for any NaN data
city_df.isna().sum()

city            0
driver_count    0
type            0
dtype: int64

In [10]:
#get data types

city_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [11]:
# use unique() to return an array or list of the unique values of the column

city_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [33]:
# find sum of Surburban and Rural
sum(city_df["type"]=="Urban")
sum(city_df["type"]=="Rural")
sum(city_df["type"]=="Suburban")

36

In [37]:
# Inspect Ride Data DataFrame

# Get the columns and the rows that are not null

ride_df.count()

#find isna()

ride_df.isna().sum()

#get data types of each columns

ride_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [42]:
## merging the DataFrames

#combine the data into a single data set

pyber_df = pd.merge(ride_df, city_df, how="left", on=["city", "city"])
                                                   
pyber_df.head(10)

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
5,South Latoya,2019-03-11 12:26:48,9.52,1994999424437,10,Urban
6,New Paulville,2019-02-27 11:17:56,43.25,793208410091,44,Urban
7,Simpsonburgh,2019-04-26 00:43:24,35.98,111953927754,21,Urban
8,South Karenland,2019-01-08 03:28:48,35.09,7995623208694,4,Urban
9,North Jasmine,2019-03-09 06:26:29,42.81,5327642267789,33,Urban